/*
  3. Изучить правила игры в Blackjack. Подумать, как написать данную игру на 
  С++, используя объектно-ориентированное программирование. Сколько будет 
  классов в программе? Какие классы будут базовыми, а какие производными? 
  Продумать реализацию игры с помощью классов и записать результаты в виде 
  комментария в основном файле сдаваемой работы.

  ============================================================================

  для участников:
    
    базовый:
    class Person {};
    
    производные:
    class Player : public Person {};
    class Dealer : public Person {};
    
  для игры:
    class Card {};


  У всех участников будет собственный массив карт. Таккже будет общая 
  колода-массив не сданых карт
*/